touchhowling/hello_beagley/j722s-evm/c75ss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "J722S_TDA4VEN_TDA4AEN_AM67" --package "AMW" --part "Default" --context "c75ss0-0" --product "MCU_PLUS_SDK_J722S@09.02.00"
 * @versions {"tool":"1.20.0+3587"}
 */

/**
 * Import the modules used in this configuration.
 */
const ipc        = scripting.addModule("/drivers/ipc/ipc");
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const mmu_armv8  = scripting.addModule("/kernel/dpl/mmu_armv8", {}, false);
const mmu_armv81 = mmu_armv8.addInstance();
const mmu_armv82 = mmu_armv8.addInstance();
const mmu_armv83 = mmu_armv8.addInstance();
const mmu_armv84 = mmu_armv8.addInstance();
const mmu_armv85 = mmu_armv8.addInstance();
const mmu_armv86 = mmu_armv8.addInstance();
const mmu_armv87 = mmu_armv8.addInstance();
const mmu_armv88 = mmu_armv8.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
ipc.c75ss1_0 = "NONE";

debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.UART.RXD.$assign = "UART0_RXD";
debug_log.uartLog.UART.TXD.$assign = "UART0_TXD";

mmu_armv81.size              = 0x20000000;
mmu_armv81.$name             = "REGISTER_REGION_0";
mmu_armv81.accessPermissions = "Privilege RW, User RW";
mmu_armv81.privExecute       = false;

mmu_armv82.vAddr             = 0x20000000;
mmu_armv82.pAddr             = 0x20000000;
mmu_armv82.size              = 0x20000000;
mmu_armv82.$name             = "REGISTER_REGION_1";
mmu_armv82.accessPermissions = "Privilege RW, User RW";
mmu_armv82.privExecute       = false;

mmu_armv83.vAddr             = 0x40000000;
mmu_armv83.pAddr             = 0x40000000;
mmu_armv83.size              = 0x20000000;
mmu_armv83.$name             = "REGISTER_REGION_2";
mmu_armv83.accessPermissions = "Privilege RW, User RW";
mmu_armv83.privExecute       = false;

mmu_armv84.vAddr             = 0x60000000;
mmu_armv84.pAddr             = 0x60000000;
mmu_armv84.size              = 0x4000000;
mmu_armv84.$name             = "FSS0_DAT_REGION";
mmu_armv84.accessPermissions = "Privilege RW, User RW";
mmu_armv84.privExecute       = false;

mmu_armv85.vAddr             = 0x7C200000;
mmu_armv85.pAddr             = 0x7C200000;
mmu_armv85.$name             = "CLEC";
mmu_armv85.accessPermissions = "Privilege RW, User RW";
mmu_armv85.size              = 0x100000;
mmu_armv85.privExecute       = false;

mmu_armv86.$name             = "DRU";
mmu_armv86.vAddr             = 0x7C400000;
mmu_armv86.pAddr             = 0x7C400000;
mmu_armv86.size              = 0x100000;
mmu_armv86.accessPermissions = "Privilege RW, User RW";
mmu_armv86.privExecute       = false;

mmu_armv87.vAddr       = 0x80000000;
mmu_armv87.pAddr       = 0x80000000;
mmu_armv87.size        = 0x80000000;
mmu_armv87.attribute   = "MAIR7";
mmu_armv87.$name       = "DDR_0";
mmu_armv87.userExecute = true;

mmu_armv88.vAddr     = 0xA3410000;
mmu_armv88.pAddr     = 0xA3410000;
mmu_armv88.size      = 0x1000;
mmu_armv88.attribute = "MAIR4";
mmu_armv88.$name     = "CCS_DEBUG_LOG_MEM";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
debug_log.uartLog.UART.$suggestSolution = "USART0";
